app/views/admin/_rooms_information.html.erb


<h5><%= pluralize(Room.count, "Room") %> Created</h5>
<h5><%= pluralize(Message.count, "Message") %> In Total</h5>
---
SELECT COUNT(*) FROM "rooms"
SELECT COUNT(*) FROM "messages"