app/views/admin/_users_information.html.erb

SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

<h5><%= pluralize(User.count, "User") %> Created</h5>
<h5><%= pluralize(User.online.count, "Users") %> Online</h5>
<h5><%= pluralize(User.user.count, "User") %></h5>