app/views/users/_users.html.erb

  <% room_name = get_name(user, current_user) %>
  <% single_room = Room.where(name: room_name).first || Room.create_private_room([user, current_user], room_name) %>
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 ORDER BY "rooms"."id" ASC LIMIT $2  [["name", "private_1_2"], ["LIMIT", 1]]