app/channels/appearance_channel.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["status", 0], ["updated_at", "2022-12-20 13:05:18.198882"], ["id", 1]]
---
  def broadcast_new_status(status)
    target_user = User.find_by(id: current_user.id)

    current_user.update!(status:) unless target_user.dnd?