app/views/rooms/_last_message.html.erb

INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["room_id", 1], ["body", "Test"], ["created_at", "2022-12-20 13:27:09.795369"], ["updated_at", "2022-12-20 13:27:09.795369"]]
---
      <em class="last-message"><%= "#{last_message.user.username} sent a message".truncate(40) %></em>
      <%= content_tag(:em, class:"last-message-time", data: { time: last_message.created_at.to_i }) do %>