app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["room_id", 1], ["body", "Test"], ["created_at", "2022-12-20 13:27:09.795369"], ["updated_at", "2022-12-20 13:27:09.795369"]]
---
  def create
    @message = current_user.messages.build(
      body: msg_params[:body],
      room_id: params[:room_id],
      attachments: msg_params[:attachments]
    )

    unless @message.save