app/controllers/pages_controller.rb

SELECT COUNT(*) FROM "users" WHERE "users"."status" != $1  [["status", 0]]
---
  def home
    recent_messages
    @online_users = User.where.not(status: User.statuses[:offline]).count

UPDATE "users" SET "updated_at" = ?, "status" = ? WHERE "users"."id" = ?  [["updated_at", "2022-12-20 13:05:18.113294"], ["status", 0], ["id", 1]]
---
  def set_status
    current_user&.update!(status: User.statuses[:offline])