app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" INNER JOIN "joinables" ON "rooms"."id" = "joinables"."room_id" WHERE "joinables"."user_id" = $1 ORDER BY last_message_at DESC  [["user_id", 1]]
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-12-20 12:37:41.608943"], ["status", 2], ["id", 1]]
---
  def index
    @room = Room.new
    @joined_rooms = current_user.joined_rooms.order('last_message_at DESC')
    @rooms = search_rooms
    current_user.update(current_room: nil)

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" INNER JOIN "joinables" ON "rooms"."id" = "joinables"."room_id" WHERE "joinables"."user_id" = ? ORDER BY last_message_at DESC  [["user_id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ? ORDER BY "messages"."created_at" DESC LIMIT ?  [["room_id", 4], ["LIMIT", 1]]
---
  def show
    @single_room = Room.find(params[:id])
    current_user.update(current_room: @single_room)

    @room = Room.new
    @rooms = search_rooms
    @joined_rooms = current_user.joined_rooms.order('last_message_at DESC')

    @message = Message.new

    pagy_messages = @single_room.messages.includes(:user).order(created_at: :desc)

UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-12-20 12:37:41.608943"], ["status", 2], ["id", 1]]
---
  def set_status
    return if current_user.dnd?

    current_user&.update!(status: User.statuses[:online])

UPDATE "notifications" SET "read_at" = ? WHERE (json_extract(params, '$.room') = '{"_aj_globalid":"gid://turbochatter/Room/1"}') AND "notifications"."recipient_type" = ? AND "notifications"."recipient_id" = ? AND "notifications"."read_at" IS NULL  [["read_at", "2022-12-20 13:05:12.146575"], ["recipient_type", "User"], ["recipient_id", 1]]
---
  def set_notifications_to_read
    notifications = @single_room.notifications_as_room.where(recipient: current_user).unread
    notifications.update_all(read_at: Time.zone.now)