app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @users = User.all_except(current_user)

    @room = Room.new
    @rooms = Room.public_rooms
    @room_name = get_name(@user, current_user)
    @single_room = Room.where(name: @room_name).first || Room.create_private_room([@user, current_user], @room_name)

    @message = Message.new
    @messages = @single_room.messages.order(created_at: :asc)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at", "last_message_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "private_1_1"], ["is_private", true], ["created_at", "2022-12-20 13:27:04.505755"], ["updated_at", "2022-12-20 13:27:04.505755"], ["last_message_at", nil]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."name" = $1 ORDER BY "rooms"."id" ASC LIMIT $2  [["name", "private_1_1"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" DESC LIMIT $2 OFFSET $3  [["room_id", 1], ["LIMIT", 10], ["OFFSET", 0]]