app/models/message.rb

SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = $1 AND "participants"."room_id" = $2 ORDER BY "participants"."id" ASC LIMIT $3  [["user_id", 1], ["room_id", 1], ["LIMIT", 1]]
---
  def confirm_participant
    return unless room.is_private

    is_participant = Participant.where(user_id: user.id, room_id: room.id).first

UPDATE "rooms" SET "updated_at" = $1, "last_message_at" = $2 WHERE "rooms"."id" = $3  [["updated_at", "2022-12-20 13:27:09.809095"], ["last_message_at", "2022-12-20 13:27:09.806024"], ["id", 1]]
---
  def update_parent_room
    room.update(last_message_at: Time.now)

SELECT COUNT(*) AS "count_all", strftime('%Y-%m-%d', "messages"."created_at") AS "strftime_y_m_d_messages_created_at" FROM "messages" WHERE ("messages"."created_at" >= '2022-11-20 13:05:22.245032' AND "messages"."created_at" <= '2022-12-20 13:05:22.245599') GROUP BY strftime('%Y-%m-%d', "messages"."created_at")
---
  def self.messages_this_month
    messages = Message.group_by_day(:created_at, range: 1.month.ago..Time.now).count

SELECT "users".* FROM "users" INNER JOIN "joinables" ON "users"."id" = "joinables"."user_id" WHERE "joinables"."room_id" = $1  [["room_id", 1]]
---
  def notify_recipients
    users_in_room = room.joined_users
    users_in_room.each do |user|