app/models/room.rb

  def self.create_private_room(users, room_name)
    single_room = Room.create(name: room_name, is_private: true)
    users.each do |user|
      Participant.create(user_id: user.id, room_id: single_room.id)
---
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["room_id", 4], ["created_at", "2022-12-20 12:37:41.750858"], ["updated_at", "2022-12-20 12:37:41.750858"]]
INSERT INTO "rooms" ("name", "hstore", "is_private", "created_at", "updated_at", "last_message_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "private_1_2"], ["hstore", nil], ["is_private", true], ["created_at", "2022-12-20 12:55:54.560660"], ["updated_at", "2022-12-20 12:55:54.560660"], ["last_message_at", nil]]

  def participant?(room, user)
    room.participants.where(user:).exists?
---
SELECT 1 AS one FROM "participants" WHERE "participants"."room_id" = ? AND "participants"."user_id" = ? LIMIT ?  [["room_id", 1], ["user_id", 2], ["LIMIT", 1]]